{
  "actions": [
    {
      "acted_at": "2014-06-23T20:50:00-04:00", 
      "references": [
        {
          "reference": "CR H5636-5638", 
          "type": "consideration"
        }, 
        {
          "reference": "CR H5636", 
          "type": "text"
        }
      ], 
      "text": "Amendment (A008) offered by Mr. Garrett.", 
      "type": "action"
    }, 
    {
      "acted_at": "2014-06-24T14:18:00-04:00", 
      "how": "roll", 
      "references": [
        {
          "reference": "CR H5662-5663", 
          "type": "consideration"
        }
      ], 
      "result": "pass", 
      "roll": 347, 
      "text": "On agreeing to the Garrett amendment (A008) Agreed to by recorded vote: 252 - 158 (Roll no. 347).", 
      "type": "vote", 
      "vote_type": "vote", 
      "where": "h"
    }
  ], 
  "amendment_id": "hamdt954-113", 
  "amendment_type": "hamdt", 
  "amends_amendment": null, 
  "amends_bill": {
    "bill_id": "hr4413-113", 
    "bill_type": "hr", 
    "congress": 113, 
    "number": 4413
  }, 
  "amends_treaty": null, 
  "chamber": "h", 
  "congress": "113", 
  "description": "Amendment exempts Registered Investment Companies (RICs) that are currently registered with the Securities and Exchange Commission (SEC) under the Investment Company Act of 1940 from duplicative registration requirements with the Commodity Futures Trading Commission (CFTC) allowing the SEC to continue to have full regulatory oversight and enforcement authority over RICs. Amendment does not remove the jurisdiction and regulatory authority that the CFTC has over all futures, options and swaps transactions that the RICs invest in on behalf of their customers who are pensioners, retirees, and savers.", 
  "house_number": 8, 
  "introduced_at": "2014-06-23", 
  "number": 954, 
  "purpose": "An amendment No. 8 printed in House Report 113-476 to exempt Registered Investment Companies (RICs) that are currently registered with the Securities and Exchange Commission (SEC) under the Investment Company Act of 1940 from duplicative registration requirements with the Commodity Futures Trading Commission (CFTC) allowing the SEC to continue to have full regulatory oversight and enforcement authority over RICs. Amendment does not remove the jurisdiction and regulatory authority that the CFTC has over all futures, options and swaps transactions that the RICs invest in on behalf of their customers who are pensioners, retirees, and savers.", 
  "sponsor": {
    "district": "5", 
    "name": "Garrett, Scott", 
    "state": "NJ", 
    "thomas_id": "01737", 
    "title": "Rep", 
    "type": "person"
  }, 
  "status": "pass", 
  "status_at": "2014-06-24T14:18:00-04:00", 
  "updated_at": "2014-08-14T13:39:30-04:00"
}